Catalogs/EDiN_СтатусыОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>EDiN_СтатусыОбмена</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеобходимОтвет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусУчастникаОбменаЭТТН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Системный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/EDiN_СтатусыОбмена/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостьюИДоступностью();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()
	
	Элементы.Код.ТолькоПросмотр = Объект.Системный;
	Элементы.Статус.ТолькоПросмотр = Объект.Системный;
	Элементы.СтатусУчастникаОбменаЭТТН.ТолькоПросмотр = Объект.Системный;
	Элементы.НеобходимОтвет.ТолькоПросмотр = Объект.Системный;
	Элементы.КодОтвета.ТолькоПросмотр = Объект.Системный;
	
	Элементы.КодОтвета.Видимость = Объект.НеобходимОтвет;
	
КонецПроцедуры

&НаКлиенте
Процедура НеобходимОтветПриИзменении(Элемент)
	УправлениеВидимостьюИДоступностью();
КонецПроцедуры
